; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-14)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city16)
	(fuel-level plane1 fl4)
	(at plane2 city0)
	(fuel-level plane2 fl2)
	(at plane3 city8)
	(fuel-level plane3 fl2)
	(at plane4 city15)
	(fuel-level plane4 fl6)
	(at person1 city3)
	(at person2 city12)
	(at person3 city8)
	(at person4 city17)
	(at person5 city15)
	(at person6 city3)
	(at person7 city6)
	(at person8 city3)
	(at person9 city12)
	(at person10 city10)
	(at person11 city6)
	(at person12 city17)
	(at person13 city6)
	(at person14 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city4)
	(at plane2 city15)
	(at plane4 city14)
	(at person1 city0)
	(at person2 city14)
	(at person3 city17)
	(at person4 city13)
	(at person5 city3)
	(at person6 city4)
	(at person7 city9)
	(at person8 city17)
	(at person10 city8)
	(at person12 city7)
	(at person13 city16)
	(at person14 city16)
	))

)

; plan
1. (zoom plane4 city15 city17 fl6 fl5 fl4)
   deleted: (at plane4 city15) (fuel-level plane4 fl6)
   added: (at plane4 city17) (fuel-level plane4 fl4)
   goals met: 0 of 15
2. (zoom plane4 city17 city3 fl4 fl3 fl2)
   deleted: (at plane4 city17) (fuel-level plane4 fl4)
   added: (at plane4 city3) (fuel-level plane4 fl2)
   goals met: 0 of 15
3. (board person8 plane4 city3)
   deleted: (at person8 city3)
   added: (in person8 plane4)
   goals met: 0 of 15
4. (board person6 plane4 city3)
   deleted: (at person6 city3)
   added: (in person6 plane4)
   goals met: 0 of 15
5. (board person1 plane4 city3)
   deleted: (at person1 city3)
   added: (in person1 plane4)
   goals met: 0 of 15
6. (board person3 plane3 city8)
   deleted: (at person3 city8)
   added: (in person3 plane3)
   goals met: 0 of 15
7. (zoom plane3 city8 city17 fl2 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl2)
   added: (at plane3 city17) (fuel-level plane3 fl0)
   goals met: 0 of 15
8. (board person4 plane3 city17)
   deleted: (at person4 city17)
   added: (in person4 plane3)
   goals met: 0 of 15
9. (refuel plane3 city17 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 0 of 15
10. (debark person3 plane3 city17)
   deleted: (in person3 plane3)
   added: (at person3 city17)
   goals met: 1 of 15
11. (board person12 plane3 city17)
   deleted: (at person12 city17)
   added: (in person12 plane3)
   goals met: 1 of 15
12. (zoom plane2 city0 city15 fl2 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl2)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 2 of 15
13. (board person5 plane2 city15)
   deleted: (at person5 city15)
   added: (in person5 plane2)
   goals met: 2 of 15
14. (refuel plane2 city15 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 2 of 15
15. (zoom plane1 city16 city4 fl4 fl3 fl2)
   deleted: (at plane1 city16) (fuel-level plane1 fl4)
   added: (at plane1 city4) (fuel-level plane1 fl2)
   goals met: 3 of 15
16. (fly plane3 city17 city13 fl1 fl0)
   deleted: (at plane3 city17) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 3 of 15
17. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 15
18. (debark person4 plane3 city13)
   deleted: (in person4 plane3)
   added: (at person4 city13)
   goals met: 4 of 15
19. (board person14 plane3 city13)
   deleted: (at person14 city13)
   added: (in person14 plane3)
   goals met: 4 of 15
20. (fly plane3 city13 city16 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city16) (fuel-level plane3 fl0)
   goals met: 4 of 15
21. (refuel plane3 city16 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 15
22. (debark person14 plane3 city16)
   deleted: (in person14 plane3)
   added: (at person14 city16)
   goals met: 5 of 15
23. (fly plane3 city16 city7 fl1 fl0)
   deleted: (at plane3 city16) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 5 of 15
24. (debark person12 plane3 city7)
   deleted: (in person12 plane3)
   added: (at person12 city7)
   goals met: 6 of 15
25. (fly plane2 city15 city3 fl1 fl0)
   deleted: (at plane2 city15) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 5 of 15
26. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 15
27. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   goals met: 6 of 15
28. (fly plane2 city3 city15 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 7 of 15
29. (zoom plane4 city3 city0 fl2 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl2)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 7 of 15
30. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 15
31. (debark person1 plane4 city0)
   deleted: (in person1 plane4)
   added: (at person1 city0)
   goals met: 8 of 15
32. (fly plane4 city0 city17 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city17) (fuel-level plane4 fl0)
   goals met: 8 of 15
33. (refuel plane4 city17 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 15
34. (debark person8 plane4 city17)
   deleted: (in person8 plane4)
   added: (at person8 city17)
   goals met: 9 of 15
35. (fly plane4 city17 city4 fl1 fl0)
   deleted: (at plane4 city17) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 9 of 15
36. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 9 of 15
37. (debark person6 plane4 city4)
   deleted: (in person6 plane4)
   added: (at person6 city4)
   goals met: 10 of 15
38. (fly plane4 city4 city10 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city10) (fuel-level plane4 fl0)
   goals met: 10 of 15
39. (refuel plane4 city10 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 10 of 15
40. (board person10 plane4 city10)
   deleted: (at person10 city10)
   added: (in person10 plane4)
   goals met: 10 of 15
41. (fly plane4 city10 city8 fl1 fl0)
   deleted: (at plane4 city10) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 10 of 15
42. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 10 of 15
43. (debark person10 plane4 city8)
   deleted: (in person10 plane4)
   added: (at person10 city8)
   goals met: 11 of 15
44. (fly plane4 city8 city12 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city12) (fuel-level plane4 fl0)
   goals met: 11 of 15
45. (refuel plane4 city12 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 15
46. (board person2 plane4 city12)
   deleted: (at person2 city12)
   added: (in person2 plane4)
   goals met: 11 of 15
47. (fly plane4 city12 city14 fl1 fl0)
   deleted: (at plane4 city12) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 12 of 15
48. (debark person2 plane4 city14)
   deleted: (in person2 plane4)
   added: (at person2 city14)
   goals met: 13 of 15
49. (zoom plane1 city4 city6 fl2 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl2)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 12 of 15
50. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 15
51. (board person7 plane1 city6)
   deleted: (at person7 city6)
   added: (in person7 plane1)
   goals met: 12 of 15
52. (board person13 plane1 city6)
   deleted: (at person13 city6)
   added: (in person13 plane1)
   goals met: 12 of 15
53. (fly plane1 city6 city16 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city16) (fuel-level plane1 fl0)
   goals met: 12 of 15
54. (refuel plane1 city16 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 15
55. (debark person13 plane1 city16)
   deleted: (in person13 plane1)
   added: (at person13 city16)
   goals met: 13 of 15
56. (fly plane1 city16 city9 fl1 fl0)
   deleted: (at plane1 city16) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 13 of 15
57. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 15
58. (debark person7 plane1 city9)
   deleted: (in person7 plane1)
   added: (at person7 city9)
   goals met: 14 of 15
59. (fly plane1 city9 city4 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 15 of 15
